#include "shared.h"

int main()
{
    double step = init();
    
    double x = from;
    while (fabs(to - x) >= step)
    {
        make_table_line(x, f(x));
        x += step;
    }

    return 0;
}

/*

      ( Начало )
           |
        ___L__
       / step |
       -------
          |
       +------+
       |x=from|
       +------+
          |
          |<-------+
          |        |
          ^        |
         / \       |
        /   \      |
       /     \     |
  Да  / x<=to \ Нет|
  +---\       /----+------+
  |    \     /     |      |
  |     \   /      |  ( Конец )
  |      \ /       |
  |       V        |
  |                |
  |                |
  +-------+        |
          |        |
      ++------++   |
      || f(x) ||   |
      ++------++   |
          |        |
        __L____    |
       / f(x) /    |
       -------     |
          |        |
      +-------+    |
      |x+=step|    |
      +-------+    |
          |        | 
          +---------
*/